{
  "category_id": 8,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-11-17T15:48:18.588454",
  "items": [
    {
      "title": "Apply for Deserted Woman Certificate, Tamil Nadu",
      "link": "https://www.tnesevai.tn.gov.in/Citizen/PortalLogin.aspx",
      "description": "Through the Tamil Nadu e-Sevai portal, women can apply online for the Deserted Woman Certificate, issued to those abandoned by their husbands and living separately. This certificate enables beneficiaries to access welfare schemes, financial assistance, and social support programs offered by the government. The portal ensures a simple and efficient online process for application submission, verification, and certificate issuance, promoting transparency and ease of service delivery.",
      "pubDate": "Wed, 12 Nov 2025 09:33:05 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Check Property Eviction Application Status, Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getPropertyEvictiomOrderappStatus",
      "description": "This online facility allows senior citizens in Telangana to track the status of their property eviction cases filed with the District Collector. Users can view updates, case details, and orders related to eviction proceedings. The service promotes transparency, accessibility, and timely information, helping elderly citizens stay informed about their property-related cases and ensuring effective implementation of their rights under the Maintenance and Welfare of Parents and Senior Citizens Act.",
      "pubDate": "Thu, 06 Nov 2025 11:20:58 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Check Case Application Status, Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getTribualOrderappStatus",
      "description": "This service enables senior citizens in Telangana to check the real-time status of their maintenance or property deed cancellation applications submitted to the Maintenance Tribunal. The platform provides updates on case progress, hearing dates, and orders, ensuring transparency and accessibility. It empowers senior citizens to stay informed about their legal proceedings without visiting government offices, promoting efficiency and convenience.",
      "pubDate": "Thu, 06 Nov 2025 11:19:35 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Print/ Download Application and Acknowledgement Form, Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getApplicationNo",
      "description": "Through this service, senior citizens in Telangana can easily print or download their submitted application and acknowledgement forms for maintenance, property cancellation, or eviction cases. The platform enhances convenience and transparency by providing digital access to official documents. It supports elderly citizens in tracking their applications and maintaining proper records for legal and administrative purposes.",
      "pubDate": "Thu, 06 Nov 2025 11:18:09 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Appeal To Appellate Property Eviction, Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getAppealToAppeallatePropertyEviction",
      "description": "This service allows senior citizens in Telangana to appeal against orders related to property eviction cases issued by the District Collector. The appeal can be submitted to the Appellate Tribunal for review and justice under the Maintenance and Welfare of Parents and Senior Citizens Act. The platform ensures fair hearing, legal support, and quick resolution, safeguarding the property rights and dignity of elderly citizens.",
      "pubDate": "Thu, 06 Nov 2025 11:16:34 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Eviction from Property (Collector), Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getPropertyEvictionOTP",
      "description": "This online facility enables senior citizens in Telangana to initiate property eviction proceedings under the Maintenance and Welfare of Parents and Senior Citizens Act. Managed by the District Collector, the service helps elders reclaim their property from unauthorized occupants or individuals causing distress. It ensures legal protection, promotes justice, and upholds the rights of senior citizens through a simplified, transparent, and accessible digital process.",
      "pubDate": "Thu, 06 Nov 2025 11:15:06 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Appeal To Appellate Tribunal (Collector), Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getAppealToAppeallate",
      "description": "This service allows senior citizens in Telangana to submit appeals to the Appellate Tribunal headed by the District Collector against orders issued by the Maintenance Tribunal (RDO). The online system ensures transparency, convenience, and speedy resolution of disputes concerning maintenance and welfare. It empowers senior citizens to seek justice effectively, protecting their rights and ensuring their safety and well-being through the state’s welfare mechanisms.",
      "pubDate": "Thu, 06 Nov 2025 11:13:53 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Senior Citizens Apply for Maintenance/ Property Deed Cancellation (RDO), Telangana",
      "link": "https://tgseniorcitizens.cgg.gov.in/getTribunalFormAOTP",
      "description": "This portal enables senior citizens in Telangana to apply online for maintenance support or cancellation of property deeds under the Maintenance and Welfare of Parents and Senior Citizens Act. Managed by the Revenue Divisional Officer (RDO), it ensures timely redressal of grievances related to neglect or property disputes. The service promotes legal protection, financial security, and dignity for elderly citizens through a transparent and accessible digital process.",
      "pubDate": "Thu, 06 Nov 2025 11:11:27 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Register Senior Citizen for the Safety by Delhi Police, Delhi",
      "link": "https://seniorcitizen.delhipolice.gov.in/",
      "description": "The Delhi Police Senior Citizen Registration portal is designed to ensure the safety and well-being of elderly residents in the city. Through this platform, senior citizens can register their details with local police stations to receive regular assistance, protection, and support in emergencies. The initiative fosters a sense of security and care by enabling direct communication between seniors and the police. It reflects Delhi Police’s commitment to community policing, promoting dignity, safety,...",
      "pubDate": "Wed, 22 Oct 2025 14:05:34 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Social Security and Old Age Welfare, Delhi",
      "link": "https://socialwelfare.delhi.gov.in/social/social-security-and-old-age-welfare",
      "description": "The Social Security and Old Age Welfare portal of the Delhi Government provides details and access to various welfare schemes supporting senior citizens, widows, differently-abled individuals, and economically weaker groups. Citizens can apply for pensions, financial aid, and social assistance programs designed to ensure dignity and security in old age. The platform simplifies applications and provides transparent updates on welfare benefits. It represents Delhi’s commitment to inclusive governance,...",
      "pubDate": "Wed, 22 Oct 2025 14:03:06 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Schemes of Dr. Ambedkar Foundation",
      "link": "https://ambedkarfoundation.nic.in/schemes.html",
      "description": "This official page provides detailed information on various welfare and development schemes initiated by the Dr. Ambedkar Foundation, under the Ministry of Social Justice and Empowerment. It highlights programs aimed at promoting social equality, education, skill development, and empowerment of marginalized communities. Visitors can explore eligibility criteria, objectives, and application processes for multiple schemes dedicated to fulfilling the vision of Dr. B.R. Ambedkar in uplifting disadvantaged...",
      "pubDate": "Fri, 17 Oct 2025 14:49:11 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Postal Life Insurance by India Post",
      "link": "https://pli.indiapost.gov.in/CustomerPortal/Home.action",
      "description": "The India Post portal allows citizens to apply online for Postal Life Insurance (PLI) services. Offering affordable insurance plans, PLI is designed to provide financial security to individuals and families. Through this platform, users can explore policies, apply digitally, and manage existing insurance accounts with ease. The portal simplifies the enrollment process, reduces paperwork, and provides secure access to policy details. It reflects India Post’s commitment to extending reliable insurance...",
      "pubDate": "Thu, 16 Oct 2025 14:37:10 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Mukh Mantri Punjab Cancer Raahat Kosh Scheme, Punjab",
      "link": "https://mmpcrk.gov.in/",
      "description": "Mukh Mantri Punjab Cancer Raahat Kosh Scheme was initiated by the Government of Punjab with a view to provide financial assistance to Punjab resident cancer patients. Financial assistance of up to Rs.1.50 Lakhs (One lakh fifty thousand) is provided for the treatment to each cancer patient except Government employees, ESI employees and their dependents, those patients who have any kind of facility of medical reimbursement or any other persons who have opted for Health Insurance by Insurance companies.",
      "pubDate": "Thu, 16 Oct 2025 12:38:05 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Financial Assistance Schemes of Old Age Assistance, Delhi",
      "link": "https://socialwelfare.delhi.gov.in/social/financial-assistance-schemes",
      "description": "Financial Assistance Schemes of Old Age Assistance, Delhi provide monthly support to senior citizens, ensuring financial security in their later years. Beneficiaries aged 60–69 years receive Rs. 2,000 per month, remitted quarterly, through Aadhaar-linked bank accounts under the Aadhaar Payment Bridge System;. Additionally, individuals belonging to SC, ST, or Minority communities are entitled to an extra Rs. 500 per month. Rs. 2,500/- p.m. remitted quarterly for all beneficiaries 70 years and above....",
      "pubDate": "Wed, 17 Sep 2025 14:44:59 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Disability Pension/ Widow Pension/ Old Age Pension by e-Labharthi, Bihar",
      "link": "https://elabharthi.bihar.gov.in/",
      "description": "e-Labharthi is a centralized beneficiary management portal in Bihar for schemes like pensions, scholarships, and free bicycles. It ensures accurate beneficiary identification, improves service delivery, and consolidates information across departments such as Education, SC/ST Welfare, Social Security, and Minority Welfare. Users can track application status and access scheme benefits easily.",
      "pubDate": "Tue, 24 Jun 2025 12:41:32 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Disability Certificate/ UDID Card, Punjab",
      "link": "https://connect.punjab.gov.in/service/redirect/1048",
      "description": "The UDID (Unique Disability ID) card streamlines access to various benefits for Persons with Disabilities in Punjab. It serves as a single document for identification and verification, eliminating the need to carry multiple documents. The card stores essential disability details and simplifies benefit tracking across village, district, state, and national levels. Applicants can apply online and upload required documents for efficient issuance and nationwide recognition.",
      "pubDate": "Fri, 30 May 2025 16:56:52 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Dependent Children Pension Scheme, Punjab",
      "link": "https://connect.punjab.gov.in/service/citizenservice/116",
      "description": "The scheme supports children under 21 years whose parents are deceased, missing, or incapacitated. With an annual family income cap of ₹60,000, the scheme provides monthly financial assistance to ensure the child’s well-being and education. In the absence of the original guardian, a successor or near relative is nominated by the SDM to continue receiving benefits without interruption. This ensures continuous support for vulnerable children in Punjab.",
      "pubDate": "Fri, 30 May 2025 10:36:23 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Disabled Person Pension Scheme, Punjab",
      "link": "https://connect.punjab.gov.in/service/citizenservice/114",
      "description": "This scheme offers monthly financial assistance to persons with 80% or more disability, including dwarfs, aged 18 years and above. Beneficiaries receive ₹300 per month, which increases to ₹500 after the age of 80. The initiative ensures financial support and dignity for persons with severe disabilities, helping them meet basic needs and live independently. The pension helps reduce economic dependency and improve the quality of life for eligible individuals in Punjab.",
      "pubDate": "Fri, 30 May 2025 10:33:02 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Widow Destitute Pension Scheme, Punjab",
      "link": "https://connect.punjab.gov.in/service/citizenservice/112",
      "description": "The Widow/Destitute Pension Scheme provides financial support to widows, destitute women below 58 years, and unmarried women above 30 years in Punjab. Eligible applicants must have a total annual income not exceeding ₹60,000, including income from business, rent, or interest. The scheme aims to ensure economic stability and social security for women facing hardship due to loss of spouse or prolonged unmarried status. Applicants can apply online through the official Punjab Connect portal.",
      "pubDate": "Fri, 30 May 2025 10:28:27 +0530",
      "category": "Pension and Benefits"
    },
    {
      "title": "Apply for Old Age Pension Scheme, Punjab",
      "link": "https://connect.punjab.gov.in/service/citizenservice/108",
      "description": "This scheme provides financial support to elderly citizens in Punjab women aged 58 years and above and men aged 65 years and above. Eligible individuals must have a monthly income not exceeding ₹2000 (single) or ₹3000 (couple), with land ownership limits also applying. The pension aims to ensure social security and dignity for the elderly who lack sufficient means of support. Applications can be submitted online through the dedicated portal for quick and transparent processing.",
      "pubDate": "Fri, 30 May 2025 10:25:30 +0530",
      "category": "Pension and Benefits"
    }
  ]
}