{
  "category_id": 3,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-10-26T10:25:30.089946",
  "items": [
    {
      "title": "Download Acknowledgement CM's Multi-Storey Bangalore Housing Project of 1 BHK, Karnataka",
      "link": "https://ashraya.karnataka.gov.in/cm_selection_flat/download_ack.aspx",
      "description": "This portal allows applicants of the Chief Minister’s Multi-Storey Housing Project for 1 BHK flats in Bangalore to download their official acknowledgement receipt. It provides confirmation of application submission, ensuring transparency and accountability in the housing allocation process. The acknowledgement document serves as proof of registration, helping applicants track their status and maintain records. This initiative reflects the Karnataka Government’s commitment to streamlining affordable...",
      "pubDate": "Wed, 22 Oct 2025 14:39:10 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for CM's Multi-Storey Bangalore Housing Project of 2 BHK, Karnataka",
      "link": "https://ashraya.karnataka.gov.in/cm_onelakh_2bhk/index_2BHK.aspx",
      "description": "The Karnataka Government’s Ashraya portal facilitates applications for the Chief Minister’s Multi-Storey Housing Project, offering 2 BHK flats in Bangalore. Designed to provide affordable and secure housing to low and middle-income groups, the initiative addresses the city’s growing urban housing demand. Through the online platform, citizens can check eligibility, apply, and track application status. The scheme reflects the government’s vision of inclusive development, ensuring access to...",
      "pubDate": "Wed, 22 Oct 2025 14:23:23 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for CM's Multi-Storey Bangalore Housing Project of 1 BHK, Karnataka",
      "link": "https://ashraya.karnataka.gov.in/cm_selection_flat/frmPhoto_VideoGallery.aspx",
      "description": "The Karnataka Government’s Ashraya Housing portal allows eligible citizens to apply for the Chief Minister’s Multi-Storey Housing Project offering 1 BHK flats in Bangalore. The scheme aims to provide affordable, quality housing to urban poor and middle-income groups, improving their standard of living. Applicants can access information, submit applications, and review project details online. The platform ensures transparency, fairness, and accountability, reflecting the state’s commitment to...",
      "pubDate": "Wed, 22 Oct 2025 14:18:54 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Pradhan Mantri Awaas Yojana - Gramin",
      "link": "https://pmayg.dord.gov.in/netiayHome/home.aspx",
      "description": "The Pradhan Mantri Awaas Yojana – Gramin (PMAY-G) portal provides rural citizens with access to apply for housing assistance under this flagship government scheme. It aims to provide “pucca” houses with basic amenities to rural families, especially those from economically weaker sections. Applicants can log in, check eligibility, and track application status online. The digital platform ensures transparency, efficiency, and accountability, empowering rural households to achieve secure and dignified...",
      "pubDate": "Fri, 17 Oct 2025 15:17:14 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Housing (Flats and villas) by Bangalore Development Authority, Karnataka",
      "link": "https://housing.bdabangalore.org/",
      "description": "This portal enables citizens to apply online for housing projects offered by the Bangalore Development Authority (BDA), including flats and villas across various locations in Bengaluru. Applicants can view ongoing schemes, check eligibility criteria, access application forms, and track allotment details. The platform simplifies the process of purchasing BDA-developed properties, ensuring transparency, easy navigation, and timely updates for individuals seeking affordable and well-planned residential...",
      "pubDate": "Fri, 17 Oct 2025 14:16:21 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Sakala Services of Guarantee to Citizens System, Karnataka",
      "link": "https://ipgrs.karnataka.gov.in/",
      "description": "The Sakala initiative of Karnataka guarantees citizens timely delivery of essential government services under the Sakala Services Act. Accessible through the IPGRS platform, it enables applicants to apply for services, track applications, and ensure accountability with service-level guarantees. Citizens receive assurance that delays or lapses are addressed responsibly. By reducing bureaucratic inefficiencies and enhancing transparency, Sakala strengthens governance and ensures that people can avail...",
      "pubDate": "Fri, 17 Oct 2025 14:12:12 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Check GIS Information by Bangalore Development Authority, Karnataka",
      "link": "https://gisbda.karnataka.gov.in/BDALandManagement/gisapplication/login.jsp",
      "description": "This GIS-enabled portal by the Bangalore Development Authority provides detailed geographic and land management information. Through a secure login, users can access maps, layouts, property details, and development plans for different areas in Bangalore. The system enhances urban planning, ensures transparency in land records, and helps citizens verify property information easily. It supports better decision-making for both authorities and the public, reducing disputes and promoting efficient land...",
      "pubDate": "Thu, 16 Oct 2025 14:40:42 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application Form for Printing of Affidavits of change of Names by Gazette, Meghalaya",
      "link": "https://mspsdc.meghalaya.gov.in/pdf/Application_form_printing_affidavit.pdf",
      "description": "This application form enables citizens of Meghalaya to apply for the printing of affidavits related to name changes in the official Gazette. It is an essential step for individuals seeking to legally update their names in government records, identity documents, or certificates. The form ensures transparency and authenticity, providing applicants with a standardized process to request name change publication. By facilitating official recognition, it helps individuals secure updated credentials aligned...",
      "pubDate": "Tue, 23 Sep 2025 15:21:06 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Dashboard of Department of Atomic Energy",
      "link": "https://dashboard.dae.gov.in/",
      "description": "The Department of Atomic Energy (DAE) dashboard offers a comprehensive digital platform to access key data, reports, and performance indicators related to India’s atomic energy initiatives. It provides insights into research activities, regulatory processes, licensing information, and project developments. The dashboard enhances transparency, efficiency, and monitoring by consolidating real-time updates in one place. Users can explore various aspects of nuclear research, energy generation, radiation...",
      "pubDate": "Thu, 11 Sep 2025 12:31:25 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Mukhya Mantri Gram Sadak Yojana, Maharashtra",
      "link": "https://woms.mahaonline.gov.in/",
      "description": "The Mukhya Mantri Gram Sadak Yojana of Maharashtra aims to improve rural connectivity by constructing and maintaining all-weather roads in villages. The portal provides citizens with access to project details, progress reports, and related services under the scheme. By enhancing road infrastructure, the program boosts socio-economic development, facilitates better access to education, healthcare, and markets, and reduces isolation of remote villages. It reflects the state government’s commitment...",
      "pubDate": "Thu, 11 Sep 2025 11:48:49 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Smart Application for Revenue Administration - SAARA, Madhya Pradesh",
      "link": "https://saara.mp.gov.in",
      "description": "The Smart Application for Revenue Administration (SAARA) is an integrated digital platform launched by Madhya Pradesh for efficient management of land and revenue services. It offers a range of services, including land records, ownership applications, certificates, and grievance redressal. By providing a transparent and user-friendly system, SAARA enhances accessibility for citizens and streamlines administrative processes. It plays a vital role in promoting good governance, reducing corruption,...",
      "pubDate": "Thu, 11 Sep 2025 11:41:46 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Know Your Cooperative ID",
      "link": "https://cooperatives.gov.in/en/home/knowyourcoop",
      "description": "Know Your Cooperative ID (NCD-ID) is a unique identifier assigned to cooperatives registered in India. It is part of the National Cooperative Database, a centralized system for managing and accessing information about cooperatives. This ID helps in identifying and tracking cooperatives, facilitating various government initiatives and services related to the cooperative sector.",
      "pubDate": "Tue, 05 Aug 2025 14:42:18 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View All India Cooperatives-State/Sector-wise Database",
      "link": "https://cooperatives.gov.in/en",
      "description": "The All India Cooperatives-State/Sector-wise Database is a comprehensive resource providing detailed information on cooperative societies across India, categorized by state and sector. This database serves as a single point of access to updated information on cooperatives, aiding in planning, monitoring, and resource allocation for the cooperative movement. It allows users to analyze the geographical distribution of cooperatives and identify linkages between them.",
      "pubDate": "Tue, 05 Aug 2025 14:36:21 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application Form for Renewal Plumbing License, Punjab",
      "link": "https://pwssb.punjab.gov.in/wp-content/uploads/2018/01/5-renewal-plumbing-license.pdf",
      "description": "The Renewal Plumbing License Form in Punjab is an application form used by licensed plumbers to renew their existing plumbing licenses with the Public Health Engineering Department (PHED). This process ensures that plumbers continue to be qualified and authorized to perform plumbing work within the state, maintaining standards and public safety. The form typically requires details about the plumber, their license information, and any updates to their qualifications or contact information.",
      "pubDate": "Thu, 31 Jul 2025 14:27:14 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application Form for Plumbing License, Punjab",
      "link": "https://pwssb.punjab.gov.in/wp-content/uploads/2018/01/4-plumbing-license.pdf",
      "description": "The Application Form for a Plumbing License in Punjab requires information about the applicant's personal details, qualifications, experience, and the type of plumbing work they intend to undertake. It also includes declarations about adherence to regulations and payment of fees.",
      "pubDate": "Thu, 31 Jul 2025 14:24:19 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Complaint Registration Form for Water Supply and Sewerage, Punjab",
      "link": "https://pwssb.punjab.gov.in/wp-content/uploads/2018/01/3-complaint-registration-form.pdf",
      "description": "The Water Supply and Sewerage Complaint Registration Form in Punjab allows citizens to report issues related to their water supply and sewage systems. It's a way to formally register complaints and request action from the relevant authorities. The form typically requires details like the complainant's contact information, the nature of the complaint (e.g., water shortage, leakage, sewage over flow), the location of the problem, and potentially supporting information like a water connection number...",
      "pubDate": "Thu, 31 Jul 2025 14:22:46 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application Form for Water Supply and Sewerage Disconnection/ Reopening, Punjab",
      "link": "https://pwssb.punjab.gov.in/wp-content/uploads/2018/01/2-disconnection.pdf",
      "description": "The Application Form for Water Supply and Sewerage Disconnection/Reopening in Punjab requires details about the property, the applicant, and the reason for the disconnection or reopening. Applicants will need to specify whether the request is for a temporary or permanent disconnection/reopening, provide contact information, and may need to include supporting documents like proof of ownership and identity.",
      "pubDate": "Thu, 31 Jul 2025 14:20:37 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application Form for Water Supply and Sewerage New Connection/ Regularisation, Punjab",
      "link": "https://pwssb.punjab.gov.in/wp-content/uploads/2018/01/1-new-connection-regularisation.pdf",
      "description": "Punjab residents can download form for complaints regarding water supply and sewerage issues through the official Punjab government portal or the respective municipal corporation websites. These platforms allow citizens to report problems like water leakage, sewage over Flow, or disruptions in water supply. You can typically find these online services by searching for Punjab Water Supply and Sewerage Complaint or by navigating to the relevant sections of the Punjab government or municipal corporation...",
      "pubDate": "Thu, 31 Jul 2025 14:18:59 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Pollution Under Control Certificate, Bihar",
      "link": "https://puc.parivahan.gov.in/puc/",
      "description": "To obtain a Pollution Under Control (PUC) Certificate in Bihar, vehicle owners need to ensure their vehicles meet the required emission standards and then apply for the certificate either online or offline. The PUC certificate confirms that the vehicle's emissions are within the permissible limits, and it's mandatory for all vehicles in India.",
      "pubDate": "Tue, 29 Jul 2025 12:24:36 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Application for Loan Encumbrance Certificate, Bihar",
      "link": "https://nibandhan.bihar.gov.in/SCOREONLINE/NEConline.aspx",
      "description": "An application for a Loan Encumbrance Certificate (EC) in Bihar is a formal request to the Sub-Registrar's office to verify that a property is free from any financial or legal liabilities, like mortgages or loans, for a specific period. This certificate is crucial for property transactions, particularly when obtaining loans or proving ownership. The application needs to include details like the property's complete address, survey number, and the period for which the EC is required.",
      "pubDate": "Mon, 28 Jul 2025 14:12:49 +0530",
      "category": "Electricity, Water and Local services"
    }
  ]
}