{
  "category_id": 3,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-11-17T15:37:23.681740",
  "items": [
    {
      "title": "Apply for Residence Certificate, Tamil Nadu",
      "link": "https://www.tnesevai.tn.gov.in/Citizen/PortalLogin.aspx",
      "description": "Through the Tamil Nadu e-Sevai portal, residents can apply for the Residence Certificate, an official document verifying their place of residence within the state. This certificate is often required for school admissions, government jobs, and welfare schemes. The online service offers a streamlined and transparent process for form submission, verification, and certificate issuance, ensuring citizens can access essential government services conveniently and efficiently.",
      "pubDate": "Thu, 13 Nov 2025 09:35:46 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Other Backward Classes - OBC Certificate, Tamil Nadu",
      "link": "https://www.tnesevai.tn.gov.in/Citizen/PortalLogin.aspx",
      "description": "The OBC Certificate service on Tamil Nadu’s e-Sevai portal allows applicants to apply online for community certification under the Other Backward Classes category. This certificate is required to avail reservations in education, employment, and government schemes. The platform ensures a secure and efficient process for submission, verification, and issuance, enabling citizens to receive authenticated digital certificates quickly and conveniently without visiting government offices.",
      "pubDate": "Wed, 12 Nov 2025 10:45:40 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Family Migration Certificate, Tamil Nadu",
      "link": "https://www.tnesevai.tn.gov.in/Citizen/PortalLogin.aspx",
      "description": "The Family Migration Certificate service on the Tamil Nadu e-Sevai portal enables citizens to obtain official documentation certifying relocation of a family from one area to another. This certificate is required for updating records, school admissions, and availing government benefits. The online portal simplifies the application, document upload, and verification process, ensuring quick, transparent, and hassle-free service delivery through authenticated government channels.",
      "pubDate": "Wed, 12 Nov 2025 09:45:01 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Track Your Right to Information (RTI) Application / Appeal Status, Bihar",
      "link": "https://jaankari.bihar.gov.in/track/application",
      "description": "This service allows applicants to track the status of their RTI applications, First Appeals, or Second Appeals submitted through the Jaankari portal. Users can monitor progress, view updates, and receive notifications regarding their requests in real time. The system enhances transparency and accessibility, ensuring that citizens stay informed throughout the RTI process, thereby promoting good governance and accountability within Bihar’s administrative framework.",
      "pubDate": "Tue, 11 Nov 2025 10:27:24 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Right to Information (RTI) 2nd Appeal, Bihar",
      "link": "https://jaankari.bihar.gov.in/",
      "description": "This online facility enables citizens to file the Second Appeal under the RTI Act, 2005, through the Jaankari portal if they are unsatisfied with the decision of the First Appellate Authority. It provides a convenient and transparent platform for escalating RTI grievances to the State Information Commission. The service reinforces citizens’ right to information, fostering government accountability and ensuring fair, time-bound resolution of information-related appeals in Bihar.",
      "pubDate": "Tue, 11 Nov 2025 10:25:27 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Right to Information (RTI) 1st Appeal, Bihar",
      "link": "https://jaankari.bihar.gov.in/",
      "description": "This service allows citizens to file the First Appeal under the Right to Information (RTI) Act, 2005, if they are dissatisfied with the response or non-response to their initial RTI application. Available on the Jaankari portal, it facilitates the submission of appeals to designated Appellate Authorities. The system ensures transparency, accountability, and timely redressal, empowering citizens to seek further review and promoting openness in Bihar’s administrative processes.",
      "pubDate": "Tue, 11 Nov 2025 10:23:24 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Right to Information (RTI) Application, Bihar",
      "link": "https://jaankari.bihar.gov.in/",
      "description": "This portal enables citizens of Bihar to file Right to Information (RTI) applications online, promoting transparency and accountability in governance. Through the Jaankari platform, users can easily submit their queries to public authorities, seek information on government activities, decisions, or expenditures, and exercise their right to access public information under the RTI Act, 2005. The service simplifies the process, ensuring efficiency and accessibility for all citizens.",
      "pubDate": "Tue, 11 Nov 2025 10:21:49 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Registered Document Land Details, Telangana",
      "link": "https://bhubharati.telangana.gov.in/RegDocumentDetails",
      "description": "This online service provided by Bhumi Bharati Telangana enables users to view details of registered land documents conveniently. By entering document numbers and registration details, citizens can verify property ownership, transaction history, and registration particulars. The service ensures easy access to authentic land records, enhancing transparency, trust, and efficiency in land registration and verification processes across Telangana.",
      "pubDate": "Tue, 11 Nov 2025 09:47:39 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Prohibited Lands, Telangana",
      "link": "https://bhubharati.telangana.gov.in/prohibitedPropertySearchAgri",
      "description": "This feature on the Bhumi Bharati Telangana portal allows users to search and view details of prohibited agricultural and non-agricultural lands across the state. By entering location details, citizens can verify whether a property is restricted for sale or transfer under government regulations. The service promotes transparency in land transactions, helping prevent illegal sales and protecting buyers from disputes over prohibited properties.",
      "pubDate": "Tue, 11 Nov 2025 09:45:58 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Market Value of Land for Stamp Duty, Telangana",
      "link": "https://bhubharati.telangana.gov.in/viewMarketValueLandStampDuty",
      "description": "This service on the Bhumi Bharati Telangana portal enables citizens to view the market value of land for calculating stamp duty and registration charges. Users can access updated land valuation details based on district, mandal, and village to ensure transparency in property transactions. It helps buyers, sellers, and legal professionals make informed decisions regarding property valuation and government levies in Telangana.",
      "pubDate": "Tue, 11 Nov 2025 09:44:37 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply Hall Booking for Gandhinagar Municipal Corporation, Gujarat",
      "link": "https://enagar.gujarat.gov.in/DIGIGOV/index.jsp",
      "description": "Avail Services like Check Hall Availability, Hall Reservation, Cancel Reservation and Change Reservation Date.",
      "pubDate": "Tue, 11 Nov 2025 09:34:47 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply Water and Drainage Connection for Gandhinagar Municipal Corporation, Gujarat",
      "link": "https://enagar.gujarat.gov.in/DIGIGOV/index.jsp",
      "description": "Avail Services like New Water/Drainage Connection Application, Close Connection Application, Reopen Connection Application, Re-tapping Application, Plumber License Application and Renew of Plumber License Application.",
      "pubDate": "Tue, 11 Nov 2025 09:32:07 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply Estate Management for Gandhinagar Municipal Corporation, Gujarat",
      "link": "https://enagar.gujarat.gov.in/DIGIGOV/index.jsp",
      "description": "Renting of Estate Unit, Estate Rent Payment, Tenant Name Transfer Application, Renting of Hoardings and Sign Boards Application, Installment Payment, CSR Activity Declaration and Cancellation of Contract Agreement Application, Cancellation of Rent Agreement Application.",
      "pubDate": "Mon, 03 Nov 2025 12:21:32 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply Building Permission for Gandhinagar Municipal Corporation, Gujarat",
      "link": "https://enagar.gujarat.gov.in/DIGIGOV/index.jsp",
      "description": "Avail Services like License Application, Building Permission, Building Use Certificate Application and Apply for Issuance of Part Plan/Zoning/F-Form.",
      "pubDate": "Mon, 03 Nov 2025 12:17:09 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Property Payment Details by Patna Municipal Corporation, Bihar",
      "link": "https://pmcptax.bihar.gov.in/pmc/public/property/search_property.html?fwd_url=payment_details",
      "description": "This service by the Patna Municipal Corporation allows property owners to view detailed payment records for property tax transactions. By providing relevant property identifiers, users can access receipts, payment history, and outstanding dues. The portal promotes financial transparency and accountability, helping citizens easily monitor their tax payments, avoid penalties, and maintain up-to-date property tax compliance through a convenient online platform.",
      "pubDate": "Wed, 29 Oct 2025 10:59:18 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "View Property Details by Patna Municipal Corporation, Bihar",
      "link": "https://pmcptax.bihar.gov.in/pmc/public/property/search_property.html?fwd_url=payment_details",
      "description": "This online facility enables residents of Patna to view comprehensive details of their registered properties. By entering basic identification parameters, users can access ownership records, tax assessments, payment status, and demand details. The service enhances transparency and efficiency in property management, allowing citizens to verify their information and stay updated with official municipal data maintained by the Patna Municipal Corporation.",
      "pubDate": "Wed, 29 Oct 2025 10:57:26 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Property Self Assessment Form by Patna Municipal Corporation, Bihar",
      "link": "https://pmc.bihar.gov.in/newptax/mobile.aspx",
      "description": "The Property Self Assessment Form portal by Patna Municipal Corporation allows property owners to assess their property tax liabilities online. Citizens can input property details, calculate taxes, and submit assessments digitally without visiting municipal offices. This initiative promotes ease of doing business, transparency, and accountability in the property taxation system, empowering citizens to manage their property records conveniently and contribute to efficient urban administration in Patna.",
      "pubDate": "Wed, 29 Oct 2025 10:55:47 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Search Property with any Parameters by Patna Municipal Corporation, Bihar",
      "link": "https://pmcptax.bihar.gov.in/pmc/public/property/saf_search_property.html?fwd_url=view_assessment",
      "description": "This online service by the Patna Municipal Corporation enables citizens to search for property details using various parameters such as owner name, holding number, or ward number. It simplifies access to property-related information, helping users verify ownership, assessment records, and taxation details. The platform enhances transparency, convenience, and efficiency in managing municipal property data within Patna, fostering a user-friendly digital governance experience for residents.",
      "pubDate": "Wed, 29 Oct 2025 10:39:53 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Apply for Building Plan Approwal by Patna Municipal Corporation, Bihar",
      "link": "https://automap.bihar.gov.in/PATNABPASPORTAL/#portfolio",
      "description": "You can submit your Building Plan Approval application online on AutoMAP system and get the Building Approval Certificate at your desk.  AutoMAP can be used to apply for new building plan, revision of approved building plan, addition/alterations of existing buildings with prior approvals and occupancy permits from Patna Municipal Corporation and relating to categories of buildings mentioned in Bihar Building Bylaws 2014.",
      "pubDate": "Wed, 29 Oct 2025 10:36:52 +0530",
      "category": "Electricity, Water and Local services"
    },
    {
      "title": "Download Temporary Selection letter CM''s Multi-Storey Bangalore Housing Project of 1 BHK, Karnataka",
      "link": "https://ashraya.karnataka.gov.in/cm_selection_flat/download_selection_ack.aspx",
      "description": "Applicants of the Chief Minister’s Multi-Storey Housing Project for 1 BHK flats in Bangalore can use this portal to download their temporary selection letters. This document confirms their provisional allotment under the scheme, pending final verification and approval. The facility offers applicants digital convenience, ensuring timely updates and transparent communication. By providing easy access to official documents, the Karnataka Government demonstrates its commitment to efficient governance,...",
      "pubDate": "Wed, 29 Oct 2025 10:29:03 +0530",
      "category": "Electricity, Water and Local services"
    }
  ]
}