{
  "category_id": 2,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-11-17T15:48:16.411989",
  "items": [
    {
      "title": "Apply for Unemployment Certificate, Tamil Nadu",
      "link": "https://www.tnesevai.tn.gov.in/Citizen/PortalLogin.aspx",
      "description": "The Unemployment Certificate service available on the Tamil Nadu e-Sevai portal allows eligible citizens to apply online for certification of unemployment status. This certificate is useful for accessing various government welfare schemes, financial aid, and job assistance programs. The portal ensures a smooth digital process for form submission, document verification, and certificate download, making it convenient and time-saving for applicants seeking employment-related benefits.",
      "pubDate": "Wed, 12 Nov 2025 10:37:24 +0530",
      "category": "Jobs"
    },
    {
      "title": "Railway Recruitment Board Bengaluru, Karnataka",
      "link": "https://rrbbnc.gov.in/",
      "description": "The Railway Recruitment Board (RRB), Bengaluru, functions under the Ministry of Railways, Government of India, responsible for conducting recruitment examinations and selection processes for various Group ‘C’ posts in Indian Railways. The official website provides information on notifications, application status, examination schedules, results, and important updates for candidates. It ensures transparency and efficiency in the recruitment process while facilitating easy access to essential details...",
      "pubDate": "Wed, 12 Nov 2025 09:19:59 +0530",
      "category": "Jobs"
    },
    {
      "title": "Central Management Information System - CMIS Ver2.0, Manipur",
      "link": "https://cmis.man.nic.in/sevaarth/home1/sevaarthhome.php",
      "description": "CMIS is an integrated Personnel Management and Payroll System of Manipur Government. It has completely superceded the erstwhile MGEL/CPIS. It is also a major component of IFMS - Integrated Finance Management System of Government of Manipur.",
      "pubDate": "Mon, 03 Nov 2025 12:22:26 +0530",
      "category": "Jobs"
    },
    {
      "title": "CMIS Employee Corner through Digital Access, Manipur",
      "link": "https://employee.man.nic.in",
      "description": "The CMIS Employee Corner portal by the Government of Manipur is a centralized platform for state government employees to access human resource and administrative services. Through this portal, employees can manage personal profiles, salary slips, leave records, and other employment-related information. It enhances efficiency, transparency, and accessibility in employee management, fostering seamless interaction between government departments and their personnel in Manipur.",
      "pubDate": "Thu, 30 Oct 2025 13:48:35 +0530",
      "category": "Jobs"
    },
    {
      "title": "Register for CMIS Employee Corner, Manipur",
      "link": "https://employee.man.nic.in/",
      "description": "The CMIS Employee Corner portal of Manipur provides government employees with an easy platform to register and access essential services. By registering, employees gain access to salary details, leave records, service history, and other HR-related resources. The system streamlines employee management, ensuring efficient record-keeping and better communication between staff and administrative authorities. It also promotes transparency in service matters, allowing employees to track their personal...",
      "pubDate": "Thu, 16 Oct 2025 14:01:32 +0530",
      "category": "Jobs"
    },
    {
      "title": "Inter State Migrant Act - Application for Registration of Establishment Employing Migrant workman, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=Af2dg4tLFs525&newLink=Y&%3Ccsrf:token%20uri=%27serviceLinkHome.html%27/%3E",
      "description": "The application for registration of an establishment employing migrant workers in Bihar, under the Inter-State Migrant Workmen (Regulation of Employment and Conditions of Service) Act, 1979, is submitted using Form I (as per Rule 3(1)). This form requires details about the establishment, the principal employer, contractors (if any), and the migrant workers employed. The application, in triplicate, must be submitted to the Registering Officer of the area where the establishment is located.",
      "pubDate": "Tue, 15 Jul 2025 14:06:40 +0530",
      "category": "Jobs"
    },
    {
      "title": "Amendment of Registration of Establishments employing Contract Labour, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=TOUXOr6Y4H511",
      "description": "This service allows registered establishments in Bihar to update their contract labour registration details under the Contract Labour Act. It covers changes such as contractor information, number of workers, or nature of work. The amendment ensures that the Labour Department maintains accurate and current records for compliance and monitoring purposes.",
      "pubDate": "Fri, 27 Jun 2025 10:19:39 +0530",
      "category": "Jobs"
    },
    {
      "title": "Registration of Establishments employing Contract Labour, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=uaVgMkjfNg512",
      "description": "This service enables principal employers in Bihar to register establishments that hire 20 or more contract workers, as per the Contract Labour (Regulation and Abolition) Act, 1970. Managed by the Labour Resources Department, this registration is mandatory and ensures proper oversight of labor welfare, rights, and safety within such establishments.",
      "pubDate": "Fri, 27 Jun 2025 09:42:05 +0530",
      "category": "Jobs"
    },
    {
      "title": "Renewal of Contract Labour Registration, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=uG4DJSQ3HU515",
      "description": "Contractors in Bihar must renew their license to legally continue employing contract labor. This service enables submission of renewal applications, ideally 30 days before expiry, using Form VII. Timely applications ensure uninterrupted licensing under the Contract Labour Act. Late submissions may attract penalties, though licenses remain valid until renewal is processed.",
      "pubDate": "Fri, 27 Jun 2025 09:34:22 +0530",
      "category": "Jobs"
    },
    {
      "title": "Contract Labour Registration, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=bM8s7838Jp514",
      "description": "Establishments in Bihar employing 20 or more contract workers must register under the Contract Labour (Regulation and Abolition) Act, 1970. This service allows principal employers to obtain legal authorization for engaging contract labor. It ensures adherence to statutory norms regarding wages, working conditions, and worker welfare, promoting transparent and lawful labor practices.",
      "pubDate": "Fri, 27 Jun 2025 09:28:56 +0530",
      "category": "Jobs"
    },
    {
      "title": "Building and other Construction Workers Regulation of Employment, Bihar",
      "link": "https://serviceonline.bihar.gov.in/serviceLinkHome.html?serviceToken=NEWxex37pZ526",
      "description": "This service facilitates the regulation of employment and service conditions for building and construction workers in Bihar under the 2005 Act. It covers registration of establishments and workers, promotes welfare measures, and ensures safety standards at construction sites. Applicable to activities like building, repairs, roads, and railways, it aims to protect the rights and well-being of construction laborers.",
      "pubDate": "Fri, 27 Jun 2025 09:26:00 +0530",
      "category": "Jobs"
    },
    {
      "title": "Application for Non-Resident Labour Accident Compensation Scheme, Bihar",
      "link": "https://serviceonline.bihar.gov.in/renderApplicationForm.do?serviceId=9660004",
      "description": "The Bihar State Migrant Labour Accident Grant Scheme, part of the Labour Resource Department, provides financial assistance to migrant workers from Bihar who suffer accidental injuries while working outside the state. To apply, individuals need to register on the portal and submit the required documents, including proof of residence, age, and details about the accident.",
      "pubDate": "Thu, 26 Jun 2025 14:08:13 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply for State and Subordinate Services (Direct Recruitment) conducted by the Public Service Commission, Rajasthan",
      "link": "https://sjmsnew.rajasthan.gov.in/ebooklet",
      "description": "Successful candidates in the Rajasthan State and Subordinate Services (Direct Recruitment) Combined Competitive Examination, conducted by the Rajasthan Public Service Commission (RPSC), are provided incentives by the Rajasthan Government. This scheme motivates youth to prepare for and succeed in state-level administrative and subordinate services, fostering better governance within Rajasthan.",
      "pubDate": "Tue, 20 May 2025 12:01:08 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply Online Application for Government Jobs Vacancies, Jammu and Kashmir",
      "link": "https://jk.gov.in/jkeservices/home",
      "description": "The official portal allows citizens to apply for government job vacancies in Jammu and Kashmir, simplifying the recruitment process.",
      "pubDate": "Fri, 17 Jan 2025 14:05:25 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply for MUMKIN - Livelihood Generation Scheme, Jammu and Kashmir",
      "link": "https://www.jk.gov.in/jkeservices/home",
      "description": "The MUMKIN scheme provides financial support to youth in Jammu and Kashmir, encouraging entrepreneurship and self-employment. Eligible applicants can apply online to avail benefits.",
      "pubDate": "Thu, 16 Jan 2025 11:15:21 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply for Employer Registration, Jammu and Kashmir",
      "link": "https://jakemp.nic.in/JAKEMPUSR/create_userE.aspx",
      "description": "Employers in Jammu and Kashmir can register online or offline with District Employment &amp; Counselling Centres. The portal supports organizations in accessing skilled candidates and managing employment-related processes.",
      "pubDate": "Wed, 15 Jan 2025 10:42:33 +0530",
      "category": "Jobs"
    },
    {
      "title": "Registration for Job Seeker, Jammu and Kashmir",
      "link": "https://jakemp.nic.in/JAKEMPUSR/create_userJ.aspx",
      "description": "Job seekers in Jammu and Kashmir can register online or offline with District Employment &amp; Counselling Centres. The platform connects individuals to employment opportunities and career resources.",
      "pubDate": "Wed, 15 Jan 2025 10:40:00 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply for Renewal of Registration of Unemployed Youth, Jammu and Kashmir",
      "link": "https://jakemp.nic.in/JAKEMPUSR/login.aspx",
      "description": "Renewal of registration for unemployed youth in Jammu and Kashmir is made convenient through the District Employment &amp; Counselling Centres. Users can complete the process online via the state portal or offline at designated centers.",
      "pubDate": "Wed, 15 Jan 2025 10:38:13 +0530",
      "category": "Jobs"
    },
    {
      "title": "Apply for Registration of Unemployed Youth, Jammu and Kashmir",
      "link": "https://jakemp.nic.in/JAKEMPUSR/login.aspx",
      "description": "Unemployed youth in Jammu and Kashmir can register with District Employment &amp; Counselling Centres either online or offline. The state portal streamlines the registration process, enabling access to employment resources and opportunities.",
      "pubDate": "Wed, 15 Jan 2025 10:36:09 +0530",
      "category": "Jobs"
    },
    {
      "title": "eMigrate Project Exporter Submit Claim for PBBY Policy",
      "link": "https://www.emigrate.gov.in/#/emigrate/common/pbby-claim/external",
      "description": "Project Exporters registered under the eMigrate platform can submit insurance claims under the Pravasi Bhartiya Bima Yojana (PBBY). Managed by the Ministry of External Affairs, this service streamlines the process of claim submission and ensures timely disbursement. It supports the welfare of Indian workers employed abroad under government-approved contracts by facilitating access to policy benefits efficiently.",
      "pubDate": "Mon, 28 Apr 2025 12:32:47 +0530",
      "category": "Jobs"
    }
  ]
}