{
  "category_id": 9,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-11-17T15:48:18.930685",
  "items": [
    {
      "title": "Apply for Vehicle Maintenance Log Book and Workshop Stock Register in Patna, Bihar",
      "link": "https://pmcworkshop.bihar.gov.in/login",
      "description": "This online portal serves as the Vehicle Maintenance Log Book and Workshop Stock Register for the Patna Municipal Corporation. It enables authorized personnel to manage and record vehicle maintenance activities, inventory usage, and workshop operations efficiently. The system supports effective monitoring of municipal vehicle fleets, ensuring timely maintenance, resource optimization, and transparency in workshop management for improved service delivery in Patna.",
      "pubDate": "Thu, 30 Oct 2025 12:20:13 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Mock Test of Learner License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This online facility enables aspiring drivers in Bihar to practice and prepare for the Learner License Test through mock tests available on the Sarathi Parivahan portal. It simulates the real test format, helping applicants understand traffic rules, road safety measures, and question patterns. By attempting these mock tests, users can boost confidence and accuracy before appearing for the official test. The service provides a user-friendly, accessible, and effective method to improve preparation...",
      "pubDate": "Thu, 18 Sep 2025 11:59:09 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle Service Withdrawal, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "Through this portal, vehicle owners in Bihar can apply for the withdrawal of services related to their vehicle, such as canceling an application or request made earlier. Managed under the Sarathi Parivahan system, it ensures hassle-free online submission and tracking. The service eliminates the need for multiple visits to the RTO, thereby saving time and effort. Applicants can select Bihar as their state, log in, and proceed with withdrawal requests securely and conveniently.",
      "pubDate": "Thu, 18 Sep 2025 11:56:43 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Learner License Test, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This portal allows applicants in Bihar to apply online for the Learner License Test under the Sarathi Parivahan system. Citizens can select their state, fill in required details, book slots, and complete the process digitally. The platform ensures a streamlined, transparent, and efficient way to begin the driving license journey. It reduces manual work and saves time while offering step-by-step guidance for applicants to prepare and appear for the learner’s license test with ease.",
      "pubDate": "Thu, 18 Sep 2025 11:45:38 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Vehicle CC / NOC, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal enables applicants to apply for Vehicle Clearance Certificate (CC) or No Objection Certificate (NOC) online. These documents are essential when transferring a vehicle to another state or verifying its legal status. Users can submit applications digitally, upload necessary documents, and make payments conveniently through the portal. This service minimizes delays, reduces paperwork, and enhances transparency, offering vehicle owners a seamless and efficient way to obtain essential...",
      "pubDate": "Wed, 17 Sep 2025 11:12:34 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Driving License Extract, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This online service allows Bihar citizens to apply for a Driving License Extract through the Sarathi portal. A license extract is an official document providing details such as issuance date, validity, and driving class authorization. It is often required for legal, insurance, or international purposes. Applicants can easily request the extract by submitting details online and paying the necessary fees. The portal streamlines the process, ensuring transparency, quick service delivery, and reducing...",
      "pubDate": "Wed, 17 Sep 2025 11:10:37 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Photo Change in Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal provides an online facility for applicants to request a change of photograph in their driving license. This service is useful for updating outdated or unclear photos, ensuring accuracy in identification. Citizens can apply online by submitting required details, uploading a recent photograph, and completing fee payment. The digital platform makes the process faster, more transparent, and hassle-free, eliminating the need for multiple RTO visits while improving the authenticity...",
      "pubDate": "Wed, 17 Sep 2025 11:07:50 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Change of Address in Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This service allows driving license holders in Bihar to update their residential address on their license through the Sarathi portal. Applicants can apply online by submitting personal details, uploading proof of new address, and paying the applicable fee. The process reduces paperwork, minimizes delays, and enhances accuracy in government records. By digitizing address change requests, the portal ensures convenience for license holders, while making transport department services more accessible,...",
      "pubDate": "Wed, 17 Sep 2025 11:06:34 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Duplicate Learner License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal allows users to apply for a duplicate learner license in case of loss, damage, or theft of the original. Citizens can submit their request online by filling out application details, uploading necessary documents, and making payments digitally. The portal ensures a smooth, transparent, and time-saving process without multiple RTO visits. This online service improves accessibility and convenience, making it easier for learners to continue their driving practice with valid documentation...",
      "pubDate": "Mon, 15 Sep 2025 12:12:36 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Check online Learner License Application Status, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This service allows applicants in Bihar to check the status of their learner license application through the Sarathi portal. By entering application details, users can track progress, such as document verification, test scheduling, or approval status. The system offers transparency, reduces repeated visits to transport offices, and helps applicants remain updated about their license issuance process. It ensures efficiency by providing quick online access to information, supporting the government’s...",
      "pubDate": "Mon, 15 Sep 2025 12:11:19 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Driving License application service via the Sarathi portal allows citizens to apply for a new driving license online. Applicants can select their state, fill out forms, upload necessary documents, book slot appointments, and make payments digitally. The portal simplifies the licensing process by minimizing paperwork and providing real-time updates. This online service promotes efficiency, transparency, and convenience, enabling individuals to obtain valid driving licenses seamlessly without...",
      "pubDate": "Mon, 15 Sep 2025 12:10:13 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Know Your Vehicle Application Status, Bihar",
      "link": "https://vahan.parivahan.gov.in/vahanservice/vahan/ui/statevalidation/homepage.xhtml",
      "description": "The &quot;Know Your Vehicle Application Status&quot; service in Bihar helps applicants track the progress of their vehicle-related applications submitted through the Vahan portal. By entering details such as application number or registration details, users can instantly view updates on pending approvals, verification, or issuance of documents. This service enhances transparency, reduces the need for repeated visits to RTOs, and ensures applicants remain informed about their vehicle-related processes,...",
      "pubDate": "Mon, 15 Sep 2025 12:09:13 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Check online Vehicle e-Challan, Bihar",
      "link": "https://echallan.parivahan.gov.in/",
      "description": "The Bihar online vehicle e-Challan portal enables citizens to check traffic challans issued against their vehicles. Users can view pending challans by entering vehicle details, driving license number, or challan number. This digital service provides transparency and convenience by allowing online payment of fines, avoiding unnecessary delays. It helps vehicle owners remain updated on traffic violations, promotes adherence to road safety regulations, and ensures smooth clearance of challans without...",
      "pubDate": "Mon, 15 Sep 2025 12:05:50 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply Speed Limiting Device for Vehicle, Bihar",
      "link": "https://vahan.parivahan.gov.in/sldmaker/vahan/welcome.xhtml",
      "description": "This online service allows manufacturers and dealers in Bihar to register as authorized Speed Limiting Device (SLD) providers through the VAHAN portal. The system ensures that vehicles, especially commercial ones, comply with road safety regulations by limiting maximum speed. The portal facilitates digital applications, certification, and monitoring, ensuring accuracy and transparency. By promoting installation of speed governors, the service enhances road safety, reduces accidents, and supports...",
      "pubDate": "Mon, 15 Sep 2025 12:04:07 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle CNG Maker, Bihar",
      "link": "https://vahan.parivahan.gov.in/cngmaker/vahan/welcome.xhtml",
      "description": "The VAHAN portal provides an online platform for vehicle manufacturers and authorized dealers in Bihar to register as CNG makers. This service facilitates the approval and integration of CNG conversion kits for vehicles in compliance with safety and environmental standards. It ensures proper certification, reduces paperwork, and promotes transparency in the registration process. By encouraging the adoption of eco-friendly fuel systems, the service supports sustainable transport initiatives and cleaner...",
      "pubDate": "Mon, 15 Sep 2025 12:02:24 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle Fancy Number, Bihar",
      "link": "https://fancy.parivahan.gov.in/fancy/faces/public/login.xhtml",
      "description": "This online service enables vehicle owners in Bihar to apply for fancy or special registration numbers through the Parivahan portal. Users can check availability, bid for numbers, and complete applications digitally. The system ensures transparency in allocation, minimizes manual intervention, and provides equal opportunity to applicants. By offering convenience and efficiency, it streamlines the process of obtaining preferred registration numbers while maintaining accurate records and compliance...",
      "pubDate": "Mon, 15 Sep 2025 12:01:19 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle National Permit, Bihar",
      "link": "https://vahan.parivahan.gov.in/npermit/",
      "description": "The National Permit application service on the VAHAN portal allows vehicle owners in Bihar to apply online for permits required for interstate commercial transport. This facility simplifies the process by enabling digital applications, document uploads, and secure payments. It reduces paperwork, ensures transparency, and provides faster approvals. By granting valid national permits, the service facilitates smooth operations for transporters, enhances compliance with motor vehicle regulations, and...",
      "pubDate": "Mon, 15 Sep 2025 11:28:18 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle Dealer Point Registration, Bihar",
      "link": "https://vahan.parivahan.gov.in/vahan/vahan/ui/login/login.xhtml",
      "description": "This service on the VAHAN portal enables automobile dealers in Bihar to apply for Dealer Point Registration. It streamlines processes related to registering new vehicles directly through authorized dealers, reducing delays for customers. The online facility ensures efficiency, transparency, and convenience by allowing digital applications and status tracking. It helps maintain accurate records of new vehicle registrations and strengthens coordination between transport authorities and dealerships,...",
      "pubDate": "Fri, 12 Sep 2025 12:28:28 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Registration Certificate (RC) Release, Bihar",
      "link": "https://vahan.parivahan.gov.in/vahanservice/vahan/ui/statevalidation/homepage.xhtml",
      "description": "This VAHAN service facilitates the release of a vehicle’s Registration Certificate (RC) in Bihar after compliance with applicable requirements. Vehicle owners can apply online, submit documents, and track the process digitally. The system reduces manual delays, ensures transparency, and simplifies the procedure for users. By providing convenience and efficiency, it helps maintain accurate ownership records, supports legal compliance, and enhances the overall ease of availing transport-related services...",
      "pubDate": "Fri, 12 Sep 2025 12:27:26 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Alteration of Vehicle, Bihar",
      "link": "https://vahan.parivahan.gov.in/vahanservice/vahan/ui/statevalidation/homepage.xhtml",
      "description": "The VAHAN portal offers an online application service for vehicle owners in Bihar seeking to alter their vehicles, such as modifications in design, structure, or usage. Applicants can submit requests, provide required documents, and receive approvals digitally. This system ensures compliance with motor vehicle rules, promotes transparency, and simplifies procedures by minimizing in-person visits. By keeping registration records updated with alterations, the service ensures vehicles remain roadworthy...",
      "pubDate": "Fri, 12 Sep 2025 12:26:24 +0530",
      "category": "Transport and Infrastructure"
    }
  ]
}