{
  "category_id": 13,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
  "scraped_at": "2025-10-26T10:25:33.756135",
  "items": [
    {
      "title": "Apply for National Talent Search Scheme",
      "link": "https://ntse.ncert.gov.in/login.aspx",
      "description": "The National Talent Search Scheme (NTSE) portal by NCERT enables students to apply online for the prestigious scholarship program aimed at identifying and nurturing talented students across India. Through this portal, eligible candidates can register, log in, and track their application process. The scheme provides financial assistance and academic recognition to meritorious students, encouraging them to pursue higher education. The platform ensures transparency, accessibility, and efficiency, supporting...",
      "pubDate": "Fri, 17 Oct 2025 14:52:57 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Online Admission for National Sports University",
      "link": "https://www.nsu.ac.in/admission",
      "description": "The National Sports University offers a unique educational opportunity in sports sciences, sports technology, sports management, and sports coaching. As India’s premier institution dedicated to sports education, it plans to open new departments in line with advancements in sports-related fields. Additionally, it aims to serve as a national training center for select sports, enhancing its offerings through global partnerships.",
      "pubDate": "Wed, 08 May 2024 13:44:37 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Register for Pension to Indigent Sports Persons, Odisha",
      "link": "https://portal.sportsodisha.gov.in/Citizen/CitizenRegister",
      "description": "The Odisha state government's Department for Sports and Youth Services offers a pension registration program for financially challenged athletes, allowing players to access support and benefits in recognition of their contributions to sports.",
      "pubDate": "Tue, 16 Apr 2024 15:13:30 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Register for Sportsperson ID Card, Odisha",
      "link": "https://portal.sportsodisha.gov.in/Citizen/CitizenRegister",
      "description": "Sportsperson can apply for a sportsperson Identification Card through the Odisha state government's sports and youth services department.",
      "pubDate": "Tue, 16 Apr 2024 15:10:47 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Register for Sportsperson Weightage Certificate, Odisha",
      "link": "https://portal.sportsodisha.gov.in/Citizen/CitizenRegister",
      "description": "Register for a Sports Weightage Certificate in Odisha through the online portal, every time an individual participates in sports or earns a merit certificate, they must register a sports weight certificate, where marks are shown. These certificates from sports quota contribute a maximum of 40 marks.",
      "pubDate": "Tue, 16 Apr 2024 15:04:53 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Login for National eVidhan Application",
      "link": "https://cms.neva.gov.in",
      "description": "NeVA, short for National e-Vidhan Application, is an online platform designed to digitize the legislative processes of all state and union territory assemblies. Its primary objectives include facilitating seamless information exchange with state government departments and publishing content on a public portal. Additionally, NeVA assists the Chair of the House in conducting proceedings smoothly while enabling members to fulfill their responsibilities efficiently.",
      "pubDate": "Thu, 16 May 2024 10:32:13 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Registration for Youth Parliament Sitting (on the theme of AKAM)",
      "link": "https://nyps.mpa.gov.in/AKAM/Registration.aspx",
      "description": "As part of the &quot;Azadi Ka Amrit Mahotsava (AKAM)&quot; celebrations, special sessions of the Youth Parliament focusing on the AKAM theme is conducted by selected schools and institutions designated by their respective headquarters. These include the Kendriya Vidyalaya Sangathan Headquarters, Navodaya Vidyalaya Smiti Headquarters, and the Directorate of Education, Government of NCT of Delhi.",
      "pubDate": "Thu, 16 May 2024 10:28:55 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Registration For National Youth Parliament Scheme",
      "link": "https://nyps.mpa.gov.in/NewRegistration.aspx",
      "description": "The Ministry of Parliamentary Affairs has launched a specialized web portal to advance its Youth Parliament program. This platform hosts a range of e-training materials such as tutorials, literature, and training videos, facilitating participants' self-learning. It will serve as the primary tool for both implementing and monitoring the Ministry's Youth Parliament program.",
      "pubDate": "Thu, 16 May 2024 10:28:36 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Join with National Culture Fund",
      "link": "https://ncf.nic.in/joinus/",
      "description": "National Culture Fund Encourages and Invites Participation and Collaboration in furthering the cause of preserving the rich and varied intangible heritage of our country. Let Us Join Hands to Preserve Our Ancient Glory for Posterity.",
      "pubDate": "Tue, 12 Mar 2024 12:38:19 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Museums of India National Portal and Digital Repository",
      "link": "https://museumsofindia.gov.in/",
      "description": "Museums are a repository of a nation's culture as they contain explicit examples of the proof of the development of a country's culture and heritage over a period of time. The strengthening of the country's museums is thereby an important activity covered under the ambit of the Ministry of Culture.",
      "pubDate": "Tue, 12 Mar 2024 12:37:59 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Dashboard of Ministry of Culture",
      "link": "https://culture.dashboard.nic.in/login.aspx",
      "description": "DARPAN is designed to translate intricate government data into engaging visuals, offering administrators a quick overview of various departmental activities. The dashboard provides details about Tourists at ASI Monuments, Scheme Beneficiaries, Underprivileged Children, Manuscripts, Archival Music, Science City Visitors, Artefacts Digitized and Footfall initiatives of the Ministry of Culture.",
      "pubDate": "Tue, 12 Mar 2024 12:37:39 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Online Ticket Booking for &quot;Must See&quot; Indian Heritage",
      "link": "https://asimustsee.nic.in/",
      "description": "The Ministry of Culture's Archaeological Survey of India has developed an online portal showcasing the &quot;MUST SEE&quot; List of Indian Heritage Sites and Monuments. This curated list highlights exceptional Indian monuments and archaeological sites, including those listed on UNESCO's World Heritage List and under the protection of the Archaeological Survey of India.",
      "pubDate": "Tue, 12 Mar 2024 12:37:17 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Apply for Seva Bhoj Yojana",
      "link": "https://csms.nic.in/registration/seva_bhoj_yojana.php",
      "description": "&quot;&quot;&quot;Seva Bhoj Yojna&quot;&quot; is a Central Sector Scheme initiated by the Ministry of Culture, Government of India. Its aim is to alleviate the financial burden on charitable religious institutions that offer free Food/Prasad/Langar (Community Kitchen)/Bhandara to the public/devotees without discrimination, by reimbursing the Central Government's share of Central Goods and Services Tax (CGST) and Integrated Goods and Service Tax (IGST).&quot;",
      "pubDate": "Tue, 12 Mar 2024 12:36:53 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Centre for Cultural Resources and Training (CCRT)",
      "link": "https://ccrtindia.gov.in/",
      "description": "The CCRT revitalizes the education system by promoting awareness of India's diverse regional cultures among teachers, students, and administrators. It offers diverse training programs nationwide, including for special needs children, aiming to integrate cultural understanding into education effectively.",
      "pubDate": "Tue, 12 Mar 2024 12:36:27 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Application for use of Registration of Polo Ponies as per Performing Animals Rules, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/168234146765poloponies_updated_new.pdf",
      "description": "This service enables individuals and organizations to register polo ponies as per the Performing Animals Rules under the Animal Welfare Board of India. The process ensures the welfare of animals involved in polo by regulating their use and monitoring compliance with established standards for care and handling during events or performances.",
      "pubDate": "Tue, 29 Apr 2025 12:08:41 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Application Form for use of Performing Animals in Events /Dog Shows, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/168234145709applevents_updated_new.pdf",
      "description": "This application form is required for the use of performing animals in public events or dog shows. Regulated by the Animal Welfare Board of India, it mandates payment of a Rs. 5,000 fee and adherence to ethical treatment guidelines. It ensures animal welfare and accountability in organizing animal-inclusive events.",
      "pubDate": "Tue, 29 Apr 2025 12:10:29 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "Application Form for Registration of Race Horses as Performing Animals, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/168234143784racehorses_updated_new.pdf",
      "description": "This service allows race horse owners to register their animals as performing animals with the Animal Welfare Board of India. A fee of Rs. 2,000 per horse is required. The registration ensures that race horses are monitored for welfare standards and are used ethically in competitive events.",
      "pubDate": "Tue, 29 Apr 2025 12:11:49 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "NOC Format for Self Declaration for Post-Shoot Permission, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/171757173206168234108718applnnoc_updated_001.pdf",
      "description": "This NOC format is used to declare that animal welfare guidelines were followed during film shoots. It must be submitted to the Animal Welfare Board of India after shooting involving animals, ensuring transparency and accountability in the post-production phase.",
      "pubDate": "Tue, 29 Apr 2025 12:18:07 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "NOC Format for sending Film Shooting Intimation, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/168234113928shooting_intimation_new.pdf",
      "description": "This NOC format is required to notify the Animal Welfare Board of India before commencing film shoots involving animals. It ensures that the board is informed and can enforce ethical practices and proper treatment of animals during filming.",
      "pubDate": "Tue, 29 Apr 2025 12:20:12 +0530",
      "category": "Youth, Sports and Culture"
    },
    {
      "title": "NOC for Post-Shoot Fitness Certificate Part-B, Animal Welfare Board of India",
      "link": "https://awbi.gov.in/uploads/documents/168234122412Fitness%20Certificate%20Part-B%20(1).pdf",
      "description": "This form certifies the fitness of animals after film shoots and must be submitted to the Animal Welfare Board of India. It is part of ensuring that animals used in media productions are not harmed or distressed during shoots.",
      "pubDate": "Tue, 29 Apr 2025 12:21:25 +0530",
      "category": "Youth, Sports and Culture"
    }
  ]
}