{
  "category_id": 9,
  "category_name": "National Government Services Portal",
  "title": "National Government Services Portal",
  "description": "National Government Services Portal of India provides single window access to services offered by the various Indian Government entities. This Portal is an initiative under the India Portal Project and has been designed and developed by National Informatics Centre (NIC), Ministry of Electronics & Information Technology, Government of India.",
<<<<<<< HEAD
  "scraped_at": "2025-11-23T12:27:22.232823",
=======
  "scraped_at": "2025-11-23T15:57:18.514321",
>>>>>>> fc2327aae4a3e082fb36fdb69eb1eda34270a459
  "items": [
    {
      "title": "Check Receipt Validity for Vehicle High Security Registration Plate",
      "link": "https://bookmyhsrp.com/ReceiptValidity.aspx",
      "description": "This service allows vehicle owners to verify the validity of their High Security Registration Plate (HSRP) receipt online. By entering the receipt or vehicle registration number, users can confirm whether their booking is active and valid for fitment. The feature promotes transparency, prevents fraudulent activities, and ensures users proceed with legitimate HSRP installation under authorized channels.",
      "pubDate": "Fri, 21 Nov 2025 11:23:04 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Order Cancellation and Refund for Vehicle High Security Registration Plate",
      "link": "https://bookmyhsrp.com/OrderCancel.aspx",
      "description": "This portal allows vehicle owners to cancel their High Security Registration Plate (HSRP) order and request a refund if required. By entering booking details, users can initiate cancellation before the installation process begins. The platform ensures a smooth refund process, maintaining transparency and customer satisfaction while adhering to HSRP booking and payment policies established by authorized agencies.",
      "pubDate": "Fri, 21 Nov 2025 11:21:15 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Reschedule Your Appointment for Vehicle High Security Registration Plate",
      "link": "https://bookmyhsrp.com/ReAppointment.aspx",
      "description": "This service enables vehicle owners to easily reschedule their appointment for High Security Registration Plate (HSRP) installation. Users who missed their original slot or wish to change their appointment date can conveniently update it online by providing vehicle and booking details. The portal ensures flexibility, user convenience, and adherence to government guidelines for timely and secure HSRP fitment.",
      "pubDate": "Fri, 21 Nov 2025 11:18:47 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Track Your Order of High Security Registration Plate",
      "link": "https://bookmyhsrp.com/TrackOrder.aspx",
      "description": "This feature enables users to track the status of their High Security Registration Plate (HSRP) order online. By entering order details or vehicle registration number, users can check updates on processing, dispatch, or installation appointments. The system provides real-time tracking, ensuring transparency, convenience, and timely delivery of HSRP and color stickers to registered vehicle owners.",
      "pubDate": "Fri, 21 Nov 2025 11:15:09 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Book High Security Registration Plate For Tractor and Trailer",
      "link": "https://bookmyhsrp.com/plate/VahanBookingDetail.aspx?id=Trailer",
      "description": "This online service allows tractor and trailer owners to book High Security Registration Plates (HSRP) as per government regulations. Users can enter their registration details, select a convenient fitment location, and schedule an appointment. The platform ensures authenticity, compliance with transport norms, and vehicle security through tamper-proof, standardized plates, simplifying the registration process for agricultural and commercial vehicles.",
      "pubDate": "Fri, 21 Nov 2025 11:10:53 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Book High Security Registration Plate For Electric Vehicle",
      "link": "https://bookmyhsrp.com/plate/VahanBookingDetail.aspx?id=ElectricVehicle",
      "description": "Electric vehicle owners can use this service to book High Security Registration Plates (HSRP) specifically designed for EVs. The portal ensures compliance with government-mandated safety norms while providing secure and tamper-proof plates. Users can book online by entering vehicle details, choosing a fitment center, and selecting suitable dates for installation, promoting sustainable mobility and regulatory adherence.",
      "pubDate": "Fri, 21 Nov 2025 11:08:56 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Book Only Vehicle Colour Sticker High Security Registration Plate",
      "link": "https://bookmyhsrp.com/sticker/VahanBookingDetail.aspx",
      "description": "This portal facilitates the booking of only color-coded stickers associated with High Security Registration Plates (HSRP). Designed to indicate the vehicle’s fuel type, these stickers are mandatory for easy identification and regulatory compliance. Vehicle owners can book their color sticker online, select a convenient fitment location, and ensure adherence to government safety and environmental standards.",
      "pubDate": "Fri, 21 Nov 2025 11:07:06 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Book Vehicle Replacement/ Retain/ Transfer High Security Registration Plate",
      "link": "https://bookmyhsrp.com/plate/ReplacementBooking.aspx",
      "description": "This service enables vehicle owners to book replacement, retention, or transfer of their High Security Registration Plate (HSRP). Whether due to damage, theft, or change in ownership, users can easily apply online by entering their vehicle registration details. The platform ensures smooth processing and compliance with transport department regulations, offering a hassle-free experience for managing HSRP-related updates.",
      "pubDate": "Fri, 21 Nov 2025 11:05:34 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Book Vehicle High Security Registration Plate with Colour Sticker",
      "link": "https://bookmyhsrp.com/sticker/VahanBookingDetail.aspx",
      "description": "This portal allows vehicle owners to conveniently book High Security Registration Plates (HSRP) with color-coded stickers as per government regulations. Users can enter their vehicle details, select their state, and schedule an appointment for installation at authorized centers. The platform ensures authenticity, compliance, and safety, helping vehicle owners meet mandatory HSRP norms efficiently and securely.",
      "pubDate": "Fri, 21 Nov 2025 11:03:43 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle Maintenance Log Book and Workshop Stock Register in Patna, Bihar",
      "link": "https://pmcworkshop.bihar.gov.in/login",
      "description": "This online portal serves as the Vehicle Maintenance Log Book and Workshop Stock Register for the Patna Municipal Corporation. It enables authorized personnel to manage and record vehicle maintenance activities, inventory usage, and workshop operations efficiently. The system supports effective monitoring of municipal vehicle fleets, ensuring timely maintenance, resource optimization, and transparency in workshop management for improved service delivery in Patna.",
      "pubDate": "Thu, 30 Oct 2025 12:20:13 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Mock Test of Learner License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This online facility enables aspiring drivers in Bihar to practice and prepare for the Learner License Test through mock tests available on the Sarathi Parivahan portal. It simulates the real test format, helping applicants understand traffic rules, road safety measures, and question patterns. By attempting these mock tests, users can boost confidence and accuracy before appearing for the official test. The service provides a user-friendly, accessible, and effective method to improve preparation...",
      "pubDate": "Thu, 18 Sep 2025 11:59:09 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Vehicle Service Withdrawal, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "Through this portal, vehicle owners in Bihar can apply for the withdrawal of services related to their vehicle, such as canceling an application or request made earlier. Managed under the Sarathi Parivahan system, it ensures hassle-free online submission and tracking. The service eliminates the need for multiple visits to the RTO, thereby saving time and effort. Applicants can select Bihar as their state, log in, and proceed with withdrawal requests securely and conveniently.",
      "pubDate": "Thu, 18 Sep 2025 11:56:43 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Learner License Test, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This portal allows applicants in Bihar to apply online for the Learner License Test under the Sarathi Parivahan system. Citizens can select their state, fill in required details, book slots, and complete the process digitally. The platform ensures a streamlined, transparent, and efficient way to begin the driving license journey. It reduces manual work and saves time while offering step-by-step guidance for applicants to prepare and appear for the learner’s license test with ease.",
      "pubDate": "Thu, 18 Sep 2025 11:45:38 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Vehicle CC / NOC, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal enables applicants to apply for Vehicle Clearance Certificate (CC) or No Objection Certificate (NOC) online. These documents are essential when transferring a vehicle to another state or verifying its legal status. Users can submit applications digitally, upload necessary documents, and make payments conveniently through the portal. This service minimizes delays, reduces paperwork, and enhances transparency, offering vehicle owners a seamless and efficient way to obtain essential...",
      "pubDate": "Wed, 17 Sep 2025 11:12:34 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Driving License Extract, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This online service allows Bihar citizens to apply for a Driving License Extract through the Sarathi portal. A license extract is an official document providing details such as issuance date, validity, and driving class authorization. It is often required for legal, insurance, or international purposes. Applicants can easily request the extract by submitting details online and paying the necessary fees. The portal streamlines the process, ensuring transparency, quick service delivery, and reducing...",
      "pubDate": "Wed, 17 Sep 2025 11:10:37 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Photo Change in Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal provides an online facility for applicants to request a change of photograph in their driving license. This service is useful for updating outdated or unclear photos, ensuring accuracy in identification. Citizens can apply online by submitting required details, uploading a recent photograph, and completing fee payment. The digital platform makes the process faster, more transparent, and hassle-free, eliminating the need for multiple RTO visits while improving the authenticity...",
      "pubDate": "Wed, 17 Sep 2025 11:07:50 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Change of Address in Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This service allows driving license holders in Bihar to update their residential address on their license through the Sarathi portal. Applicants can apply online by submitting personal details, uploading proof of new address, and paying the applicable fee. The process reduces paperwork, minimizes delays, and enhances accuracy in government records. By digitizing address change requests, the portal ensures convenience for license holders, while making transport department services more accessible,...",
      "pubDate": "Wed, 17 Sep 2025 11:06:34 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Issue of Duplicate Learner License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Sarathi portal allows users to apply for a duplicate learner license in case of loss, damage, or theft of the original. Citizens can submit their request online by filling out application details, uploading necessary documents, and making payments digitally. The portal ensures a smooth, transparent, and time-saving process without multiple RTO visits. This online service improves accessibility and convenience, making it easier for learners to continue their driving practice with valid documentation...",
      "pubDate": "Mon, 15 Sep 2025 12:12:36 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Check online Learner License Application Status, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "This service allows applicants in Bihar to check the status of their learner license application through the Sarathi portal. By entering application details, users can track progress, such as document verification, test scheduling, or approval status. The system offers transparency, reduces repeated visits to transport offices, and helps applicants remain updated about their license issuance process. It ensures efficiency by providing quick online access to information, supporting the government’s...",
      "pubDate": "Mon, 15 Sep 2025 12:11:19 +0530",
      "category": "Transport and Infrastructure"
    },
    {
      "title": "Apply for Driving License, Bihar",
      "link": "https://sarathi.parivahan.gov.in/sarathiservice/stateSelection.do",
      "description": "The Bihar Driving License application service via the Sarathi portal allows citizens to apply for a new driving license online. Applicants can select their state, fill out forms, upload necessary documents, book slot appointments, and make payments digitally. The portal simplifies the licensing process by minimizing paperwork and providing real-time updates. This online service promotes efficiency, transparency, and convenience, enabling individuals to obtain valid driving licenses seamlessly without...",
      "pubDate": "Mon, 15 Sep 2025 12:10:13 +0530",
      "category": "Transport and Infrastructure"
    }
  ]
}